### Prepared by Abhishek Kumar
### https://www.linkedin.com/in/abhishekkumar-0311/

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# To get multiple outputs in the same cell

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

%matplotlib inline

In [3]:
# Setup : DataFrame creation

salary = [['1','Abhishek Kumar','AIML', 'Machine Learning Engineer','M', 'Y', '04051990', 1121000],
          ['2','Arjun Kumar','DM', 'Tech Lead','M', 'Y', '09031992', 109000],
          ['3','Vivek Raj','DM', 'Devops Engineer','M', 'N', np.NaN , 827000],
          ['4','Mika Singh','DM', 'Data Analyst','F', 'Y', '15101991',  np.NaN],
          ['5','Anusha Yenduri','AIML', 'Data Scientist','F', 'Y', '01011989',  921000],
          ['6','Ritesh Srivastava','AIML', 'Data Engineer','M', 'Y', np.NaN, 785000]]

columns_name=['Emp_Id','Emp_Name','Department','Role','Gender', 'WFH Status', 'DOB', 'Salary']

emp_df = pd.DataFrame(salary,columns=columns_name)
emp_df

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,AIML,Machine Learning Engineer,M,Y,04051990,1121000.0
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000.0
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000.0
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,NaN
4,5,Anusha Yenduri,AIML,Data Scientist,F,Y,01011989,921000.0
5,6,Ritesh Srivastava,AIML,Data Engineer,M,Y,NaN,785000.0

# 1. Group By: Split-Apply-Combine


    i. df.groupby()
    ii. .apply() , .agg(), .filter()
    iii.

In [4]:
emp_df_1 = emp_df.copy()
emp_df_1

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,AIML,Machine Learning Engineer,M,Y,04051990,1121000.0
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000.0
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000.0
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,NaN
4,5,Anusha Yenduri,AIML,Data Scientist,F,Y,01011989,921000.0
5,6,Ritesh Srivastava,AIML,Data Engineer,M,Y,NaN,785000.0

In [5]:
grouped_1 = emp_df_1.groupby('Department')
grouped_1

## 1.1 Meta Methods

    Meta methods are less concerned with the original object on which .groupby() is called.
    Mainly provide high-level information such as the number of groups and indices of those groups.

In [6]:
grouped_1.groups

{'AIML': [0, 4, 5], 'DM': [1, 2, 3]}

In [7]:
grouped_1.get_group('DM')

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000.0
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000.0
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,NaN

In [8]:
grouped_1.indices

{'AIML': array([0, 4, 5], dtype=int64), 'DM': array([1, 2, 3], dtype=int64)}

In [9]:
grouped_1.ndim

2

In [10]:
grouped_1.ngroups

2

In [11]:
# Assign this to a new variable. This will assign a number to each group
grouped_1.ngroup()

0    0
1    1
2    1
3    1
4    0
5    0
dtype: int64

In [12]:
grouped_1.dtypes

            Emp_Id Emp_Name    Role  Gender WFH Status     DOB   Salary
Department
AIML        object   object  object  object     object  object  float64
DM          object   object  object  object     object  object  float64

In [13]:
#for i in range(2):
#    grouped_1.__iter__()

In [14]:
grouped_1.size()

Department
AIML    3
DM      3
dtype: int64

In [15]:
len(grouped_1)

2

## 1.2 Filter Methods

    Filter methods return a subset of the original DataFrame. 
    Most common is .filter() to drop entire groups based on some comparative statistic about that group and its sub-table. 
    There are a number of methods that exclude particular rows from each group.

In [16]:
grouped_2 = emp_df_1.groupby('Department')
grouped_2

In [17]:
grouped_2.first()

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
Department,,,,,,,
AIML,1,Abhishek Kumar,Machine Learning Engineer,M,Y,04051990,1121000.0
DM,2,Arjun Kumar,Tech Lead,M,Y,09031992,109000.0

In [18]:
grouped_2.last()

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
Department,,,,,,,
AIML,6,Ritesh Srivastava,Data Engineer,M,Y,01011989,785000.0
DM,4,Mika Singh,Data Analyst,F,Y,15101991,827000.0

In [19]:
grouped_2.head(2)

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,AIML,Machine Learning Engineer,M,Y,04051990,1121000.0
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000.0
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000.0
4,5,Anusha Yenduri,AIML,Data Scientist,F,Y,01011989,921000.0

In [20]:
grouped_2.tail(1)

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,NaN
5,6,Ritesh Srivastava,AIML,Data Engineer,M,Y,NaN,785000.0

In [21]:
# Take the nth row from each group if n is an int, or a subset of rows if n is a list of ints.

grouped_2.nth(2)

grouped_2.nth([0,2])

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
Department,,,,,,,
AIML,6,Ritesh Srivastava,Data Engineer,M,Y,NaN,785000.0
DM,4,Mika Singh,Data Analyst,F,Y,15101991,NaN

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
Department,,,,,,,
AIML,1,Abhishek Kumar,Machine Learning Engineer,M,Y,04051990,1121000.0
AIML,6,Ritesh Srivastava,Data Engineer,M,Y,NaN,785000.0
DM,2,Arjun Kumar,Tech Lead,M,Y,09031992,109000.0
DM,4,Mika Singh,Data Analyst,F,Y,15101991,NaN

In [22]:
# we are selecting the 0th and 2nd rows, not rows whose indices equal 0 and 2.

grouped_2.take([0,2])

             Emp_Id           Emp_Name                       Role Gender  \
Department
AIML       0      1     Abhishek Kumar  Machine Learning Engineer      M
           5      6  Ritesh Srivastava              Data Engineer      M
DM         1      2        Arjun Kumar                  Tech Lead      M
           3      4         Mika Singh               Data Analyst      F

             WFH Status       DOB     Salary
Department
AIML       0          Y  04051990  1121000.0
           5          Y       NaN   785000.0
DM         1          Y  09031992   109000.0
           3          Y  15101991        NaN

### Selecting group based on the condition that applies on the whole group

In [23]:
grouped_1 = emp_df_1.groupby('Department', as_index=False)
grouped_1

# The argument of filter must be a function that, applied to the group as a whole, returns True or False.

grouped_1.filter(lambda x: max(x['Salary']) >= 1121000.0)

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,AIML,Machine Learning Engineer,M,Y,04051990,1121000.0
4,5,Anusha Yenduri,AIML,Data Scientist,F,Y,01011989,921000.0
5,6,Ritesh Srivastava,AIML,Data Engineer,M,Y,NaN,785000.0

In [25]:
# The argument of filter must be a function that, applied to the group as a whole, returns True or False.

grouped_1.filter(lambda x: len(x['Emp_Id']) >=3)

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary,PctSalary
0,1,Abhishek Kumar,AIML,Machine Learning Engineer,M,Y,04051990,1121000.0,1121000.0
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000.0,827000.0
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000.0,827000.0
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,NaN,827000.0
4,5,Anusha Yenduri,AIML,Data Scientist,F,Y,01011989,921000.0,1121000.0
5,6,Ritesh Srivastava,AIML,Data Engineer,M,Y,NaN,785000.0,1121000.0

In [26]:
# The argument of filter must be a function that, applied to the group as a whole, returns True or False.

grouped_2.filter(lambda x: sum(x['Salary']) >= 950000)

,Emp_Id,Emp_Name,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,Machine Learning Engineer,M,Y,04051990,1121000.0
4,5,Anusha Yenduri,Data Scientist,F,Y,01011989,921000.0
5,6,Ritesh Srivastava,Data Engineer,M,Y,NaN,785000.0

## 1.3 Aggregation Methods
- .agg()

    Aggregation methods (also called reduction methods) smush many data points into an aggregated statistic about those data points.
    An example is to take the sum, mean, or median of 10 numbers, where the result is just a single number.

In [27]:
grouped_3 = emp_df_1.groupby('Department')
grouped_3

In [28]:
# grouped_3.agg(np.sum)

grouped_3.agg('sum')

               Salary  PctSalary
Department
AIML        2827000.0  3363000.0
DM           936000.0  2481000.0

In [29]:
grouped_3.agg('mean')

                   Salary  PctSalary
Department
AIML        942333.333333  1121000.0
DM          468000.000000   827000.0

### + Applying multiple functions at once

In [30]:
x= grouped_3.agg(['max','mean', 'min'])
x

               Salary                           PctSalary             \
                  max           mean       min        max       mean
Department
AIML        1121000.0  942333.333333  785000.0  1121000.0  1121000.0
DM           827000.0  468000.000000  109000.0   827000.0   827000.0


                  min
Department
AIML        1121000.0
DM           827000.0

### - End

### + Analysing the aggregated result dataframe

In [31]:
x.ndim

2

In [32]:
x.size

12

In [33]:
x.shape

(2, 6)

In [34]:
len(x)

2

In [35]:
x.iloc[:,2:]

              Salary  PctSalary
                 min        max       mean        min
Department
AIML        785000.0  1121000.0  1121000.0  1121000.0
DM          109000.0   827000.0   827000.0   827000.0

In [36]:
x.columns
x.columns[0]

MultiIndex([(   'Salary',  'max'),
            (   'Salary', 'mean'),
            (   'Salary',  'min'),
            ('PctSalary',  'max'),
            ('PctSalary', 'mean'),
            ('PctSalary',  'min')],
           )

('Salary', 'max')

In [37]:
x.index
x.index[0]

Index(['AIML', 'DM'], dtype='object', name='Department')

'AIML'

### - End

In [38]:
# as_index = False does not create the groupby columns as Indexes

grouped_3a = emp_df_1.groupby(['Department','Gender'], as_index = False)
grouped_3a

In [39]:
grouped_3a.agg('sum')
grouped_3a['Salary'].agg(['sum'])

  Department Gender     Salary  PctSalary
0       AIML      F   921000.0  1121000.0
1       AIML      M  1906000.0  2242000.0
2         DM      F        0.0   827000.0
3         DM      M   936000.0  1654000.0

                         sum
Department Gender
AIML       F        921000.0
           M       1906000.0
DM         F             0.0
           M        936000.0

In [40]:
# We can also use the reset_index DataFrame function to achieve the same result as the column names are stored in the resulting MultiIndex

emp_df_1.groupby(['Department','Gender']).sum().reset_index()

  Department Gender     Salary  PctSalary
0       AIML      F   921000.0  1121000.0
1       AIML      M  1906000.0  2242000.0
2         DM      F        0.0   827000.0
3         DM      M   936000.0  1654000.0

In [41]:
grouped_3a.size()
grouped_3a.size().reset_index()

  Department Gender  size
0       AIML      F     1
1       AIML      M     2
2         DM      F     1
3         DM      M     2

   index Department Gender  size
0      0       AIML      F     1
1      1       AIML      M     2
2      2         DM      F     1
3      3         DM      M     2

In [42]:
grouped_3a.describe()

  Salary                                                                    \
   count      mean            std       min       25%       50%        75%
0    1.0  921000.0            NaN  921000.0  921000.0  921000.0   921000.0
1    2.0  953000.0  237587.878479  785000.0  869000.0  953000.0  1037000.0
2    0.0       NaN            NaN       NaN       NaN       NaN        NaN
3    2.0  468000.0  507702.668892  109000.0  288500.0  468000.0   647500.0

             PctSalary                                                   \
         max     count       mean  std        min        25%        50%
0   921000.0       1.0  1121000.0  NaN  1121000.0  1121000.0  1121000.0
1  1121000.0       2.0  1121000.0  0.0  1121000.0  1121000.0  1121000.0
2        NaN       1.0   827000.0  NaN   827000.0   827000.0   827000.0
3   827000.0       2.0   827000.0  0.0   827000.0   827000.0   827000.0


         75%        max
0  1121000.0  1121000.0
1  1121000.0  1121000.0
2   827000.0   827000.0
3   827000.0   827000.0

In [43]:
grouped_3a.aggregate('count')
grouped_3a.count()
grouped_3a.agg(lambda x: x.count())

,Department,Gender,Emp_Id,Emp_Name,Role,WFH Status,DOB,Salary,PctSalary
0,AIML,F,1,1,1,1,1,1,1
1,AIML,M,2,2,2,2,1,2,2
2,DM,F,1,1,1,1,1,0,1
3,DM,M,2,2,2,2,1,2,2

,Department,Gender,Emp_Id,Emp_Name,Role,WFH Status,DOB,Salary,PctSalary
0,AIML,F,1,1,1,1,1,1,1
1,AIML,M,2,2,2,2,1,2,2
2,DM,F,1,1,1,1,1,0,1
3,DM,M,2,2,2,2,1,2,2

,Department,Gender,Emp_Id,Emp_Name,Role,WFH Status,DOB,Salary,PctSalary
0,AIML,F,1,1,1,1,1,1.0,1.0
1,AIML,M,2,2,2,2,1,2.0,2.0
2,DM,F,1,1,1,1,1,0.0,1.0
3,DM,M,2,2,2,2,1,2.0,2.0

In [44]:
grouped_3a['Salary'].aggregate('count')
grouped_3a['Salary'].count()
grouped_3a['Salary'].agg(lambda x: x.count())

  Department Gender  Salary
0       AIML      F       1
1       AIML      M       2
2         DM      F       0
3         DM      M       2

  Department Gender  Salary
0       AIML      F       1
1       AIML      M       2
2         DM      F       0
3         DM      M       2

  Department Gender  Salary
0       AIML      F     1.0
1       AIML      M     2.0
2         DM      F     0.0
3         DM      M     2.0

#### Note: The aggregating functions above will exclude NA values.

### Renaming column labels

    i. .rename()
    ii. Named Aggregation

#### i. .rename()

In [45]:
grouped_3b = emp_df_1.groupby(['Department','Gender'])
grouped_3b

In [46]:
grouped_3b.agg(['min','max','mean'])
grouped_3b.agg(['min','max','mean']).rename(columns = { 'min' : 'Least', 'max': 'Most', 'mean':'Avg'})

                     Salary                       PctSalary             \
                        min        max      mean        min        max
Department Gender
AIML       F       921000.0   921000.0  921000.0  1121000.0  1121000.0
           M       785000.0  1121000.0  953000.0  1121000.0  1121000.0
DM         F            NaN        NaN       NaN   827000.0   827000.0
           M       109000.0   827000.0  468000.0   827000.0   827000.0


                        mean
Department Gender
AIML       F       1121000.0
           M       1121000.0
DM         F        827000.0
           M        827000.0

                     Salary                       PctSalary             \
                      Least       Most       Avg      Least       Most
Department Gender
AIML       F       921000.0   921000.0  921000.0  1121000.0  1121000.0
           M       785000.0  1121000.0  953000.0  1121000.0  1121000.0
DM         F            NaN        NaN       NaN   827000.0   827000.0
           M       109000.0   827000.0  468000.0   827000.0   827000.0


                         Avg
Department Gender
AIML       F       1121000.0
           M       1121000.0
DM         F        827000.0
           M        827000.0

#### ii. NamedAggregation

    To support column-specific aggregation with control over the output column names, pandas accepts the special syntax in GroupBy.agg(), known as named aggregation, where

    i. The keywords are the output column names

    ii. The values are tuples whose first element is the column to select and the second element is the aggregation to apply to that column.
    
    iii. Pandas provides the pandas.NamedAgg namedtuple with the fields ['column', 'aggfunc'] to make it clearer what the arguments are. As usual, the aggregation can be a callable or a string alias.

In [47]:
# Named Tuple

grouped_3b.agg( Max_Sal = pd.NamedAgg( column = 'Salary' , aggfunc = 'max'),
                Min_Sal = pd.NamedAgg( column = 'Salary' , aggfunc = 'min'),
                Avg_Sal = pd.NamedAgg( column = 'Salary' , aggfunc = 'mean'))


# Plain Tuple
# Also, the index is reset here.

grouped_3b.agg( Max_Sal = pd.NamedAgg( 'Salary' ,  'max'),
                Min_Id = pd.NamedAgg( 'Emp_Id' ,  'min'),
                Avg_Sal = pd.NamedAgg( 'Salary' ,  'mean')).reset_index()

                     Max_Sal   Min_Sal   Avg_Sal
Department Gender
AIML       F        921000.0  921000.0  921000.0
           M       1121000.0  785000.0  953000.0
DM         F             NaN       NaN       NaN
           M        827000.0  109000.0  468000.0

  Department Gender    Max_Sal Min_Id   Avg_Sal
0       AIML      F   921000.0      5  921000.0
1       AIML      M  1121000.0      1  953000.0
2         DM      F        NaN      4       NaN
3         DM      M   827000.0      2  468000.0

### Applying different functions to DataFrame columns

    By passing a dict to aggregate we can apply a different aggregation to the columns of a DataFrame

In [48]:
grouped_3b.agg({ 'Salary' : lambda x: np.std(x, ddof=1)})

# index on Groupby columns is also reset.
grouped_3b.agg({ 'Salary' : 'mean', 'Role' : 'sum'}).reset_index()

                          Salary
Department Gender
AIML       F                 NaN
           M       237587.878479
DM         F                 NaN
           M       507702.668892

  Department Gender    Salary                                    Role
0       AIML      F  921000.0                          Data Scientist
1       AIML      M  953000.0  Machine Learning EngineerData Engineer
2         DM      F       NaN                            Data Analyst
3         DM      M  468000.0                Tech LeadDevops Engineer

## 1.4 Transformation
- .transform()

    Transformation methods return a DataFrame with the same shape and indices as the original, but with different values. 
    With both aggregation & filter methods, the resulting DataFrame will commonly be smaller in size than the input DF. 
    This is not true of a transformation, which transforms individual values themselves but retains d shape of the original DataFrame.

In [49]:
grouped_3c = emp_df_1.groupby(['Department'])
grouped_3c.count()

            Emp_Id  Emp_Name  Role  Gender  WFH Status  DOB  Salary  PctSalary
Department
AIML             3         3     3       3           3    2       3          3
DM               3         3     3       3           3    2       2          3

In [72]:
# Here i have not created a new column
# But a new column can be created 
emp_df_1
transformed = grouped_3c.transform(lambda x : x.fillna(x.mean()))
transformed

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary,PctSalary
0,1,Abhishek Kumar,AIML,Machine Learning Engineer,M,Y,04051990,1121000.0,1121000.0
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000.0,827000.0
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000.0,827000.0
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,NaN,827000.0
4,5,Anusha Yenduri,AIML,Data Scientist,F,Y,01011989,921000.0,1121000.0
5,6,Ritesh Srivastava,AIML,Data Engineer,M,Y,NaN,785000.0,1121000.0

  Emp_Id     Salary  PctSalary
0      1  1121000.0  1121000.0
1      2   109000.0   827000.0
2      3   827000.0   827000.0
3      4   468000.0   827000.0
4      5   921000.0  1121000.0
5      6   785000.0  1121000.0

In [ ]:
# Using transform to get boolean values and then passing this boolean value to the dataframe to get the correct record
# NOT WORKING AS EXPECTED

emp_df_1['MaxSalary'] = grouped_1['Salary'].transform('max')
emp_df_1

emp_df_1['SumSalary'] = grouped_1['Salary'].transform('sum')
emp_df_1

emp_df_1['PctSalary'] = emp_df_1['Salary']/emp_df_1['SumSalary'] * 100
emp_df_1

# emp_df_1['PctSalary_2'] = grouped_1['Salary'].transform(lambda x : x.sum)
# emp_df_1

In [51]:
grouped_trans = transformed.groupby(level=0)
grouped_trans.count()

   Emp_Id  Salary  PctSalary
0       1       1          1
1       1       1          1
2       1       1          1
3       1       1          1
4       1       1          1
5       1       1          1

### + Window and resample operations

    i. rolling()
    ii. expanding()
    iii. resample()

In [52]:
df_re = pd.DataFrame({'A': [1] * 10 + [5] * 10,
                      'B': np.arange(20)})
df_re.head()
df_re.tail()

   A  B
0  1  0
1  1  1
2  1  2
3  1  3
4  1  4

    A   B
15  5  15
16  5  16
17  5  17
18  5  18
19  5  19

In [53]:
# This will apply the rolling() method on the samples of the column B based on the groups of column A.

df_re.groupby('A').rolling(4).B.sum()

A
1  0      NaN
   1      NaN
   2      NaN
   3      6.0
   4     10.0
   5     14.0
   6     18.0
   7     22.0
   8     26.0
   9     30.0
5  10     NaN
   11     NaN
   12     NaN
   13    46.0
   14    50.0
   15    54.0
   16    58.0
   17    62.0
   18    66.0
   19    70.0
Name: B, dtype: float64

In [54]:
# The expanding() method will accumulate a given operation (sum() in the example) for all the members of each particular group.

df_re.groupby('A').expanding().B.sum()

A
1  0       0.0
   1       1.0
   2       3.0
   3       6.0
   4      10.0
   5      15.0
   6      21.0
   7      28.0
   8      36.0
   9      45.0
5  10     10.0
   11     21.0
   12     33.0
   13     46.0
   14     60.0
   15     75.0
   16     91.0
   17    108.0
   18    126.0
   19    145.0
Name: B, dtype: float64

In [55]:
# ReSampling is not yet covered...

## Iteration 2

In [56]:
df1 = pd.DataFrame({'id': [1,2],
                   'name': ['a','b'],
                   'prem1' : [100,280],
                   'prem2' : [np.NaN,180],
                   'prem3' : [300,np.NaN],
                   'disc1' : [20,40],
                   'disc2' : [np.NaN,30],
                   'disc3' : [50,np.NaN],})
df1

   id name  prem1  prem2  prem3  disc1  disc2  disc3
0   1    a    100    NaN  300.0     20    NaN   50.0
1   2    b    280  180.0    NaN     40   30.0    NaN

In [57]:
df1_melted = pd.wide_to_long(df1, i=['id','name'], j='month', stubnames=['prem','disc'])
df_long = df1_melted.reset_index()

In [58]:
df_long

   id name  month   prem  disc
0   1    a      1  100.0  20.0
1   1    a      2    NaN   NaN
2   1    a      3  300.0  50.0
3   2    b      1  280.0  40.0
4   2    b      2  180.0  30.0
5   2    b      3    NaN   NaN

In [59]:
# Returns min value for each columns within each group

df_long.groupby('id').min()

   name  month   prem  disc
id
1     a      1  100.0  20.0
2     b      1  180.0  30.0

In [60]:
# Returns max value for each columns within each group

df_long.groupby('id').max()

   name  month   prem  disc
id
1     a      3  300.0  50.0
2     b      3  280.0  40.0

### FIRST and LAST returns the non-null value

In [61]:
df_long.groupby('id').first()

   name  month   prem  disc
id
1     a      1  100.0  20.0
2     b      1  280.0  40.0

In [62]:
df_long.groupby('id').last()

   name  month   prem  disc
id
1     a      3  300.0  50.0
2     b      3  180.0  30.0

### HEAD() and TAIL() - returns the actual head( n ) and tail( n ) records

In [63]:
df_long.groupby('id').head(2)

   id name  month   prem  disc
0   1    a      1  100.0  20.0
1   1    a      2    NaN   NaN
3   2    b      1  280.0  40.0
4   2    b      2  180.0  30.0

In [64]:
df_long.groupby('id').tail(1)

   id name  month   prem  disc
2   1    a      3  300.0  50.0
5   2    b      3    NaN   NaN

In [65]:
df_long2 = df_long.sort_values(['id','prem'])

In [66]:
df_long2.groupby('id').head(2)

   id name  month   prem  disc
0   1    a      1  100.0  20.0
2   1    a      3  300.0  50.0
4   2    b      2  180.0  30.0
3   2    b      1  280.0  40.0

In [67]:
df_long2.groupby('id').tail(1)

   id name  month  prem  disc
1   1    a      2   NaN   NaN
5   2    b      3   NaN   NaN

### Another way to get the first and last row is to find the INDEX of MIN or MAX value of a columns and use that index to filter out records

- idxmin() and idxmax()

In [93]:
### Here, idxmax() finds the indices of the rows with max value within groups,
### and .loc() filters the rows using those indices :

df_long2.loc[df_long2.groupby(["id"])["prem"].idxmax()]
df_long2.loc[df_long2.groupby(["id"])["prem"].idxmin()]

   id name  month   prem  disc
2   1    a      3  300.0  50.0
3   2    b      1  280.0  40.0

   id name  month   prem  disc
0   1    a      1  100.0  20.0
4   2    b      2  180.0  30.0

## TRANSFORM

https://pbpython.com/pandas_transform.html

### Creating a FLAG  , indicating the MAX or MIN value

In [68]:
df_long['flag'] = df_long.groupby('id')['prem'].transform(lambda x : x == x.max())
df_long

   id name  month   prem  disc   flag
0   1    a      1  100.0  20.0  False
1   1    a      2    NaN   NaN  False
2   1    a      3  300.0  50.0   True
3   2    b      1  280.0  40.0   True
4   2    b      2  180.0  30.0  False
5   2    b      3    NaN   NaN  False

### Using transform to perform filtering of rows
- Transform will help to create a new column or a flag
- Based on the new flag, we will filter out rows

### Examples
- 1. Simple Scenario :
    - Selecting rows with the highest / max / lowest /  min values : This can be achieved using sorting by sort_values() and head() and tail()
- 2. Not straighforward Scenario :
    - But incase of scenarios, wherein, the selection criteria is not straightforward like MIN/MAX, instead like MEAN or PCT. 
        - Then we need to first find the mean or pct within each group and find the rows which satisfy those condition.

In [87]:
# Simple scenario
# This is handled using SORT_VALUES() and HEAD()

df_long.sort_values(['id','prem'], ascending=[True, False], inplace = True)
df_long.groupby('id').head(1)

   id name  month   prem  disc  flag
2   1    a      3  300.0  50.0  True
3   2    b      1  280.0  40.0  True

In [89]:
df_long[df_long.groupby('id')['prem'].transform(lambda x : x == x.max())]

   id name  month   prem  disc  flag
2   1    a      3  300.0  50.0  True
3   2    b      1  280.0  40.0  True

In [91]:
# Complex scenario

df_long[df_long.groupby('id')['prem'].transform(lambda x : x <= x.mean())]

   id name  month   prem  disc   flag
0   1    a      1  100.0  20.0  False
4   2    b      2  180.0  30.0  False

### Alternate way :
### Transform creates a new variable , without changing the shape of the dataframe.
- It does not filter any records.  ( But can be used to filter record, by passing the BOOLEAN Value created within transform() to the original dataframe. )
    - See the above example
- In case of any requirement of creating a FLAG  , indicating the MAX or MIN value , the new column can be checked for equality using ==

In [70]:
df_long['flag'] = df_long.groupby('id')['prem'].transform('max')
df_long

   id name  month   prem  disc   flag
0   1    a      1  100.0  20.0  300.0
1   1    a      2    NaN   NaN  300.0
2   1    a      3  300.0  50.0  300.0
3   2    b      1  280.0  40.0  280.0
4   2    b      2  180.0  30.0  280.0
5   2    b      3    NaN   NaN  280.0

In [71]:
df_long['flag'] = df_long['prem'] == df_long.groupby('id')['prem'].transform('max')
df_long

   id name  month   prem  disc   flag
0   1    a      1  100.0  20.0  False
1   1    a      2    NaN   NaN  False
2   1    a      3  300.0  50.0   True
3   2    b      1  280.0  40.0   True
4   2    b      2  180.0  30.0  False
5   2    b      3    NaN   NaN  False

https://www.analyticsvidhya.com/blog/2020/03/understanding-transform-function-python/

## Creating running totals with cumsum( )

In [ ]:
d = {"salesperson":["Nico", "Carlos", "Juan", "Nico", "Nico", "Juan", "Maria", "Carlos"], "item":[10, 120, 130, 200, 300, 550, 12.3, 200]}
df = pd.DataFrame(d)
df

df["running_total"] = df["item"].cumsum()
df["running_total_by_person"] = df.groupby("salesperson")["item"].cumsum()
df

## Calculate running count with groups using cumcount() + 1

In [ ]:
d = {"salesperson":["Nico", "Carlos", "Juan", "Nico", "Nico", "Juan", "Maria", "Carlos"], "item":["Car", "Truck", "Car", "Truck", "cAr", "Car", "Truck", "Moto"]}
df = pd.DataFrame(d)
df

# Fixing columns
df["salesperson"] = df["salesperson"].str.title()
df["item"] = df["item"].str.title()

df["count_by_person"] = df.groupby("salesperson").cumcount() + 1
df["count_by_item"] = df.groupby("item").cumcount() + 1
df["count_by_both"] = df.groupby(["salesperson","item"]).cumcount() + 1
df

In [ ]:
# Creating a new dataframe
emp_df3 = emp_df.copy()

In [ ]:
emp_df3.groupby('Department').first()
emp_df3.groupby('Department').head(1)

In [ ]:
emp_df3.groupby('Department').last()
emp_df3.groupby('Department').tail(1)

In [ ]:
emp_df3.sort_values(['Department','Emp_Name'], ascending=True).groupby('Department').last()
emp_df3.sort_values(['Department','Emp_Name'], ascending=False).groupby('Department').tail(1)

In [ ]:
emp_df3.sort_values(['Department','Salary'], ascending=False).groupby('Department').last()
emp_df3.sort_values(['Department','Salary'], ascending=False).groupby('Department').tail(1)

## To generate ranking within each group
- method = 'first' / 'dense' / 'min' / 'max' / 'average'
- ascending = True/False
- pct = True

### Example 1

In [ ]:
emp_df3.dtypes
emp_df3['Salary'] = emp_df3['Salary'].astype('float')

In [ ]:
# Rank() does not work when rank is done on NON-Numeric column
emp_df3['default_rank2'] = emp_df3.groupby('Department')[['Salary']].rank(ascending=False)
emp_df3

In [ ]:
emp_df3['default_rank'] = emp_df3['Salary'].rank()
emp_df3

### Example 2

In [ ]:
data = {'close_date': ["2012-08-01", "2012-08-01", "2012-08-01", "2012-08-02", "2012-08-03", "2012-08-04", "2012-08-05", "2012-08-07"],
        'seller_name': ["Lara", "Julia", "Julia", "Emily", "Julia", "Lara", "Julia", "Julia"]
       }
df = pd.DataFrame(data)

In [ ]:
df['close_date'] = pd.to_datetime(df['close_date'])

In [ ]:
df['rank_seller_by_close_date'] = df.groupby('seller_name')['close_date'].rank(method='first')

## Other functions

In [ ]:

emp_df3['default_rank3'] = emp_df3.groupby('Department')['default_rank'].bfill()
emp_df3

In [ ]:
emp_df3.sort_values(['Department','Salary'], ascending=True).groupby('Department')['Salary'].nth(0).to_frame().reset_index()
# emp_df3

In [ ]:
emp_df3.groupby('Department')['Role'].unique()

In [ ]:
emp_df3.groupby('Department')['Role'].nunique()

In [ ]:
ods = emp_df3.groupby('Department', as_index = False)
ods['Role'].count()

In [ ]:
emp_df3.groupby('Department', as_index = False)['Role'].size()

In [ ]:
emp_df3.groupby('Department')['Role'].describe()

In [ ]:
emp_df3.groupby('Department')['Gender'].value_counts()

In [ ]:
emp_df3.groupby('Department')['Salary'].nlargest()

In [ ]:
emp_df3.groupby('Department')['Salary'].nsmallest()

In [ ]:
emp_df3.groupby('Department')['Salary'].sum()

In [ ]:
# as_index helps to create a dataframe
emp_df3.groupby('Department', as_index=False)['Salary'].min()

In [ ]:
emp_df3.groupby('Department')['Salary'].max()

In [ ]:
emp_df3.groupby('Department')['Salary'].mean()

In [ ]:
emp_df3

## Cumulative sum within each group using CUMSUM( )

In [ ]:
emp_df3['Salary'].fillna(0, inplace=True)
emp_df3

In [ ]:
emp_df3['cum_sal'] = emp_df3.groupby('Department')['Salary'].cumsum()
emp_df3

## To generate a sequential rownumber using CUMCOUNT() + 1

In [ ]:
emp_df3['Count'] = emp_df3.sort_values(['Department','Emp_Name'], ascending=True).groupby('Department')['Emp_Name'].cumcount()+1
emp_df3.sort_values(['Department','Emp_Name'], ascending=True, inplace=True)
emp_df3

#### Alternate way, not effective

In [ ]:
tmp = emp_df3.groupby('Department')['Emp_Name'].cumcount().reset_index()
tmp
tmp.rename(columns={tmp.columns[-1]:'new'},inplace=True)
tmp

In [ ]:
emp_df3 = pd.merge(emp_df3,tmp, left_index=True, right_index=True).drop('index', axis=1)
emp_df3

## LAG (+n) / LEAD (-n) functionality
## To retrieve previous  (+n) /ahead (-n) values using SHIFT(n / -n)
- shift(n) : LAG 
- shift(-n) : LEAD

In [ ]:
emp_df3.sort_values(['Department','Salary'],inplace=True)
emp_df3['PrevSal'] = emp_df3.groupby('Department')['Salary'].shift(1)
emp_df3

## Retain the last filled value to fill the NaN cells
## Using FILLNA( method = 'bfill' / 'ffill' )

### bfill - backward fill : Go Backward and fill the empty cell
### ffill  - forward fill    : Go Forward and fill the empty cell

In [ ]:
emp_df3

In [ ]:
emp_df3.loc[emp_df3.Emp_Id.isin( ['4','6']), 'PrevSal'] = np.NaN
emp_df3.sort_values(['Department','Emp_Name'], inplace = True)
emp_df3

In [ ]:
emp_df3['ForwardFilledPrevSal'] = emp_df3.groupby('Department')['PrevSal'].fillna(method = 'ffill')
emp_df3

In [ ]:
emp_df3['BackwardFilledPrevSal'] = emp_df3.groupby('Department')['PrevSal'].fillna(method = 'bfill')
emp_df3

## filling-missing-values-by-mean-in-each-group

In [ ]:
emp_df3['MeanFilledPrevSal'] = emp_df3.groupby('Department')['BackwardFilledPrevSal'].transform(lambda x: x.fillna(x.mean()))
emp_df3

### References:

#### 1. [Pandas Documentation](#https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html)
#### 2. [Real Python](#https://realpython.com/pandas-groupby/)
#### 3. [TDS - Window Functions](#https://towardsdatascience.com/window-functions-in-pandas-eaece0421f7)